In [118]:
import pandas as pd
import numpy as np

# New York City Housing Values

    Certain New York neighborhoods have been experiencing a dramatic rise in prices.  Homes in Williamsburg, Park Slope, Long Island City and Astoria that were once worth under a million dollars have seen their values in some cases triple.  Can it be possible to attain a fair price for a home and could current trends be used to predict future prices?
    The City of New York tracks sales of all properties with prices, sale dates, address, zip codes and many other data points.  I will be using the spreadsheets for Queens and Brooklyn for the years 2003 and 2016.  Some neighborhoods in these boroughs, like Williamsburg and Long Island City, have become extremely desirable.

In [119]:
queens_03 = pd.read_csv('C:\\Users\\Ryan May\\Desktop\\Springboard\\queens_sales_03.csv', low_memory=False, parse_dates=True)
queens_16 = pd.read_csv('C:\\Users\\Ryan May\\Desktop\\Springboard\\queens_sales_16.csv', low_memory=False, parse_dates=True) 
brooklyn_16 = pd.read_csv('C:\\Users\\Ryan May\\Desktop\\Springboard\\brooklyn_sales_16.csv', low_memory=False, parse_dates=True)
brooklyn_03 = pd.read_csv('C:\\Users\\Ryan May\\Desktop\\Springboard\\brooklyn_sales_03.csv', low_memory=False, parse_dates=True)

In [120]:
#Get general lay out of all tables
print(queens_03.shape)
print(queens_16.shape)
print(brooklyn_03.shape)
print(brooklyn_16.shape)

(39177, 21)
(27214, 21)
(33706, 21)
(25519, 21)

In [121]:
queens_03.head()

,BOROUGH,NEIGHBORHOOD,BUILDING CLASS CATEGORY,TAX CLASS AT PRESENT,BLOCK,LOT,EASE-MENT,BUILDING CLASS AT PRESENT,ADDRESS,APARTMENT NUMBER,...,RESIDENTIAL UNITS,COMMERCIAL UNITS,TOTAL UNITS,LAND SQUARE FEET,GROSS SQUARE FEET,YEAR BUILT,TAX CLASS AT TIME OF SALE,BUILDING CLASS AT TIME OF SALE,SALE PRICE,SALE DATE
0,4,AIRPORT LA GUARDIA,01 ONE FAMILY HOMES,1,949,20,,A5,1920 81 STREET,,...,1,0,1,"1,800","1,224",1945,1,A5,0,10/16/2003
1,4,AIRPORT LA GUARDIA,01 ONE FAMILY HOMES,1,949,47,,A5,1974 81 STREET,,...,1,0,1,"1,800","1,224",1945,1,A5,318000,6/17/2003
2,4,AIRPORT LA GUARDIA,01 ONE FAMILY HOMES,1,949,47,,A5,1974 81 STREET,,...,1,0,1,"1,800","1,224",1945,1,A5,100,5/6/2003
3,4,AIRPORT LA GUARDIA,01 ONE FAMILY HOMES,1,976,23,,A5,2136 81 STREET,,...,1,0,1,"1,800","1,224",1950,1,A5,0,7/7/2003
4,4,AIRPORT LA GUARDIA,01 ONE FAMILY HOMES,1,976,33,,A5,2156 81 STREET,,...,1,0,1,"1,800","1,224",1950,1,A5,370000,10/3/2003

Each row in the dataset is one sale of a home during the given year.  Each column is a variable for a given variable.  The most important variables for my analysis are sale price, sale date and neighborhood.

In [122]:
queens_03['SALE PRICE'].describe()

count    3.917700e+04
mean     2.351176e+05
std      5.555295e+05
min      0.000000e+00
25%      0.000000e+00
50%      1.609600e+05
75%      3.600000e+05
max      4.690000e+07
Name: SALE PRICE, dtype: float64

In [123]:
queens_03['SALE PRICE'].astype(str).astype(int)
type(queens_03['SALE PRICE'])

pandas.core.series.Series

In [124]:
queens_03.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 39177 entries, 0 to 39176
Data columns (total 21 columns):
BOROUGH                           39177 non-null int64
NEIGHBORHOOD                      39177 non-null object
BUILDING CLASS CATEGORY           39177 non-null object
TAX CLASS AT PRESENT              39177 non-null object
BLOCK                             39177 non-null int64
LOT                               39177 non-null int64
EASE-MENT                         39177 non-null object
BUILDING CLASS AT PRESENT         39177 non-null object
ADDRESS                           39177 non-null object
APARTMENT NUMBER                  39177 non-null object
ZIP CODE                          39177 non-null int64
RESIDENTIAL UNITS                 39177 non-null object
COMMERCIAL UNITS                  39177 non-null int64
TOTAL UNITS                       39177 non-null object
LAND SQUARE FEET                  39177 non-null object
GROSS SQUARE FEET                 39177 non-null object
YEAR BUILT                        39177 non-null int64
TAX CLASS AT TIME OF SALE         39177 non-null int64
BUILDING CLASS AT TIME OF SALE    39177 non-null object
SALE PRICE                        39177 non-null int64
SALE DATE                         39177 non-null object
dtypes: int64(8), object(13)
memory usage: 6.3+ MB

In [96]:
queens_03['SALE PRICE'].describe()

count    3.917700e+04
mean     2.351176e+05
std      5.555295e+05
min      0.000000e+00
25%      0.000000e+00
50%      1.609600e+05
75%      3.600000e+05
max      4.690000e+07
Name: SALE PRICE, dtype: float64

### NaN Values

One of the most glaring problems was that the houses with no sale price are listed with â€˜0â€™.  This is a problem because this would drag the average sale price down artificially.  For each dataset, I ran the below code to replace all â€˜0â€™ in the Sale Price column with NaN values.

I also want to confirm that the Sale Price Columns are integers and not strings or objects, so I will recode them as such.

In [143]:
queens_03['SALE_PRICE'].replace('0', np.nan)

SALE_DATE
2003-10-16          NaN
2003-06-17     318000.0
2003-05-06        100.0
2003-07-07          NaN
2003-10-03     370000.0
2003-12-25          NaN
2003-06-30     450000.0
2003-12-22          NaN
2003-12-30     605000.0
2003-01-28     510000.0
2003-02-27          NaN
2003-02-27          NaN
2003-12-10     167000.0
2003-05-21     136890.0
2003-02-27          NaN
2003-02-27          NaN
2003-02-27          NaN
2003-02-27          NaN
2003-02-27          NaN
2003-02-13          NaN
2003-10-10     245843.0
2003-10-10     245843.0
2003-10-31     257266.0
2003-10-10     257266.0
2003-09-23     257266.0
2003-01-10     160000.0
2003-11-14      60000.0
2003-12-16     350000.0
2003-03-06     135000.0
2003-11-20     233200.0
                ...
2003-04-16          NaN
2003-05-09          NaN
2003-05-09          NaN
2003-05-09          1.0
2003-09-10          NaN
2003-11-19          NaN
2003-07-24    1270000.0
2003-07-30          NaN
2003-07-30    1862000.0
2003-01-23     900000.0
2003-12-03     705000.0
2003-11-04          NaN
2003-11-04          NaN
2003-07-28          NaN
2003-11-13    2575000.0
2003-01-21     685000.0
2003-10-16          NaN
2003-07-09     120500.0
2003-11-20    1560000.0
2003-11-20    1560000.0
2003-11-20    1560000.0
2003-05-14          NaN
2003-10-06     170000.0
2003-03-31          NaN
2003-04-30     365000.0
2003-04-04     765000.0
2003-12-31          NaN
2003-05-14          NaN
2003-03-19          NaN
2003-12-16          NaN
Name: SALE_PRICE, dtype: float64

In [144]:
queens_16['SALE_PRICE'].replace('0', np.nan)

SALE_DATE
2016-01-14    7800000.0
2016-07-26     660000.0
2016-11-18     275500.0
2016-06-13          NaN
2016-04-14     940000.0
2016-08-15          NaN
2016-04-15     470000.0
2016-11-15     329000.0
2016-02-29     273710.0
2016-08-18     310000.0
2016-10-27     369046.0
2016-02-08          NaN
2016-04-04      46335.0
2016-05-04     359000.0
2016-01-19     289000.0
2016-09-22     370000.0
2016-05-13     107315.0
2016-10-14     733140.0
2016-03-02    1120075.0
2016-12-12     300000.0
2016-07-26     332000.0
2016-02-02     420000.0
2016-06-07          NaN
2016-12-09     260000.0
2016-04-13     229164.0
2016-11-17     201820.0
2016-12-14      55000.0
2016-10-28     347000.0
2016-04-13      56000.0
2016-08-31     305000.0
                ...
2016-03-24          NaN
2016-03-24          NaN
2016-03-24          NaN
2016-03-24          NaN
2016-03-24          NaN
2016-03-24          NaN
2016-03-24          NaN
2016-03-24          NaN
2016-03-24          NaN
2016-03-24          NaN
2016-03-24          NaN
2016-03-24          NaN
2016-03-24          NaN
2016-03-24          NaN
2016-03-24          NaN
2016-03-24          NaN
2016-03-24          NaN
2016-03-24          NaN
2016-03-24          NaN
2016-03-24          NaN
2016-03-24          NaN
2016-03-24          NaN
2016-03-24          NaN
2016-03-24          NaN
2016-03-24    6600000.0
2016-03-24          NaN
2016-03-24          NaN
2016-03-24          NaN
2016-03-24          NaN
2016-03-24          NaN
Name: SALE_PRICE, dtype: float64

In [145]:
brooklyn_16['SALE_PRICE'].replace('0', np.nan)

SALE_DATE
2016-05-25           NaN
2016-04-05      829000.0
2016-10-06           NaN
2016-06-21      790000.0
2016-03-31      788000.0
2016-10-24     1090000.0
2016-10-31           NaN
2016-02-04      920000.0
2016-02-10       40000.0
2016-02-07           NaN
2016-07-11      839000.0
2016-02-10      854000.0
2016-02-03           NaN
2016-07-25      750000.0
2016-02-23      699000.0
2016-09-23      950000.0
2016-05-13      699000.0
2016-03-22     1050000.0
2016-03-22      738000.0
2016-08-02      680000.0
2016-09-20      638000.0
2016-07-23           NaN
2016-08-01      880000.0
2016-04-29      829000.0
2016-04-15      880000.0
2016-03-14      950000.0
2016-07-20      930000.0
2016-03-30           NaN
2016-10-06           NaN
2016-03-22           NaN
                 ...
2016-05-04     1200000.0
2016-05-04           NaN
2016-11-22           NaN
2016-11-10           NaN
2016-04-28     1200000.0
2016-06-16           NaN
2016-08-29           NaN
2016-11-30      869000.0
2016-05-31      550000.0
2016-04-15      505000.0
2016-01-25      874676.0
2016-07-21     2300000.0
2016-04-07           NaN
2016-07-08           NaN
2016-10-09           NaN
2016-03-18           NaN
2016-12-28           NaN
2016-01-08           NaN
2016-12-09           NaN
2016-08-25           NaN
2016-11-29           NaN
2016-10-24           NaN
2016-01-29           NaN
2016-03-24           NaN
2016-02-18           NaN
2016-05-17     4300000.0
2016-07-13     4300000.0
2016-03-01           NaN
2016-03-01    10500000.0
2016-01-25           NaN
Name: SALE_PRICE, dtype: float64

In [146]:
type(brooklyn_03['SALE_PRICE'])

pandas.core.series.Series

In [73]:
#Repeat the same steps for all tables
brooklyn_03.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33706 entries, 0 to 33705
Data columns (total 21 columns):
BOROUGH                           33706 non-null int64
NEIGHBORHOOD                      33706 non-null object
BUILDING_CLASS_CATEGORY           33706 non-null object
TAX_CLASS_AT_PRESENT              33706 non-null object
BLOCK                             33706 non-null int64
LOT                               33706 non-null int64
EASE-MENT                         33706 non-null object
BUILDING_CLASS_AT_PRESENT         33706 non-null object
ADDRESS                           33706 non-null object
APARTMENT_NUMBER                  33706 non-null object
ZIP_CODE                          33706 non-null int64
RESIDENTIAL_UNITS                 33706 non-null object
COMMERCIAL_UNITS                  33706 non-null int64
TOTAL_UNITS                       33706 non-null object
LAND_SQUARE_FEET                  33706 non-null object
GROSS_SQUARE_FEET                 33706 non-null object
YEAR_BUILT                        33706 non-null int64
TAX_CLASS_AT_TIME_OF_SALE         33706 non-null int64
BUILDING_CLASS_AT_TIME_OF_SALE    33706 non-null object
SALE_PRICE                        33706 non-null int64
SALE_DATE                         33706 non-null datetime64[ns]
dtypes: datetime64[ns](1), int64(8), object(12)
memory usage: 5.4+ MB

In [75]:
print(brooklyn_03['SALE_PRICE'].head())

0         0
1    450000
2         0
3         0
4         0
Name: SALE_PRICE, dtype: int64

In [147]:
brooklyn_03['SALE_PRICE'].replace('0', np.nan)

SALE_DATE
2003-08-01          NaN
2003-01-24     450000.0
2003-10-08          NaN
2003-04-02          NaN
2003-04-02          NaN
2003-09-05          NaN
2003-05-12          NaN
2003-04-29          NaN
2003-01-24     570000.0
2003-02-27     320000.0
2003-06-17     427500.0
2003-04-05          NaN
2003-04-05          NaN
2003-04-05          NaN
2003-04-05          NaN
2003-07-21     355000.0
2003-05-27          NaN
2003-04-14          NaN
2003-11-20    3307131.0
2003-11-03          NaN
2003-08-29          NaN
2003-05-21     365000.0
2003-04-09     775000.0
2003-03-10     500000.0
2003-09-24     385000.0
2003-02-14     450000.0
2003-09-11     405000.0
2003-01-29     360000.0
2003-05-07          NaN
2003-07-08     407000.0
                ...
2003-01-28      28620.0
2003-09-04     300000.0
2003-06-03     715000.0
2003-12-29          NaN
2003-12-29     101524.0
2003-09-29     258000.0
2003-03-10          NaN
2003-03-26    4000000.0
2003-09-26    1085000.0
2003-07-15     330000.0
2003-07-23     585000.0
2003-09-23    1475000.0
2003-01-31     675000.0
2003-12-23          NaN
2003-08-29      33600.0
2003-04-28     425000.0
2003-04-28     425000.0
2003-02-10       5000.0
2003-10-27     300000.0
2003-10-27     490000.0
2003-08-04     102000.0
2003-12-23          NaN
2003-08-29     254400.0
2003-12-23          NaN
2003-08-29     192000.0
2003-11-21          NaN
2003-12-29     225000.0
2003-09-24     200000.0
2003-12-29     225000.0
2003-01-31     487500.0
Name: SALE_PRICE, dtype: float64

In [79]:
brooklyn_03['SALE_PRICE'].describe()

count    3.370600e+04
mean     2.563889e+05
std      6.683354e+05
min      0.000000e+00
25%      0.000000e+00
50%      1.550000e+05
75%      3.680000e+05
max      5.928000e+07
Name: SALE_PRICE, dtype: float64

In [80]:
brooklyn_16['SALE_PRICE'].describe()

count     25519
unique     3561
top        -
freq       9881
Name: SALE_PRICE, dtype: object

In [148]:
print(brooklyn_16['SALE_PRICE'].head())

SALE_DATE
2016-05-25         0.0
2016-04-05    829000.0
2016-10-06         0.0
2016-06-21    790000.0
2016-03-31    788000.0
Name: SALE_PRICE, dtype: float64

In [150]:
brooklyn_16['SALE_PRICE'].astype(int)
brooklyn_03['SALE_PRICE'].astype(int)
queens_16['SALE_PRICE'].astype(int)
queens_03['SALE_PRICE'].astype(int)

SALE_DATE
2003-10-16          0
2003-06-17     318000
2003-05-06        100
2003-07-07          0
2003-10-03     370000
2003-12-25          0
2003-06-30     450000
2003-12-22          0
2003-12-30     605000
2003-01-28     510000
2003-02-27          0
2003-02-27          0
2003-12-10     167000
2003-05-21     136890
2003-02-27          0
2003-02-27          0
2003-02-27          0
2003-02-27          0
2003-02-27          0
2003-02-13          0
2003-10-10     245843
2003-10-10     245843
2003-10-31     257266
2003-10-10     257266
2003-09-23     257266
2003-01-10     160000
2003-11-14      60000
2003-12-16     350000
2003-03-06     135000
2003-11-20     233200
               ...
2003-04-16          0
2003-05-09          0
2003-05-09          0
2003-05-09          1
2003-09-10          0
2003-11-19          0
2003-07-24    1270000
2003-07-30          0
2003-07-30    1862000
2003-01-23     900000
2003-12-03     705000
2003-11-04          0
2003-11-04          0
2003-07-28          0
2003-11-13    2575000
2003-01-21     685000
2003-10-16          0
2003-07-09     120500
2003-11-20    1560000
2003-11-20    1560000
2003-11-20    1560000
2003-05-14          0
2003-10-06     170000
2003-03-31          0
2003-04-30     365000
2003-04-04     765000
2003-12-31          0
2003-05-14          0
2003-03-19          0
2003-12-16          0
Name: SALE_PRICE, dtype: int32

### Problems With Column Names   
   When exploratory data analysis was tried was the column names in the 2016 datasets had problems.  All the column names had â€˜\nâ€™ added to the end of the column name.  While this is not necessarily a catastrophic development, it can be confusing when trying run analysis on multiple datasets.
    The spaces between the two words in the column names should be replaced with an underscore.  This will make it easier to confirm that the reader knows when the columns are being used.

In [125]:
queens_16.columns

Index(['BOROUGH\n', 'NEIGHBORHOOD\n', 'BUILDING CLASS CATEGORY\n',
       'TAX CLASS AT PRESENT\n', 'BLOCK\n', 'LOT\n', 'EASE-MENT\n',
       'BUILDING CLASS AT PRESENT\n', 'ADDRESS\n', 'APARTMENT NUMBER\n',
       'ZIP CODE\n', 'RESIDENTIAL UNITS\n', 'COMMERCIAL UNITS\n',
       'TOTAL UNITS\n', 'LAND SQUARE FEET\n', 'GROSS SQUARE FEET\n',
       'YEAR BUILT\n', 'TAX CLASS AT TIME OF SALE\n',
       'BUILDING CLASS AT TIME OF SALE\n', 'SALE PRICE\n', 'SALE DATE\n'],
      dtype='object')

In [126]:
queens_16.columns=queens_16.columns.str.replace('\n', '')

In [127]:
queens_16.columns

Index(['BOROUGH', 'NEIGHBORHOOD', 'BUILDING CLASS CATEGORY',
       'TAX CLASS AT PRESENT', 'BLOCK', 'LOT', 'EASE-MENT',
       'BUILDING CLASS AT PRESENT', 'ADDRESS', 'APARTMENT NUMBER', 'ZIP CODE',
       'RESIDENTIAL UNITS', 'COMMERCIAL UNITS', 'TOTAL UNITS',
       'LAND SQUARE FEET', 'GROSS SQUARE FEET', 'YEAR BUILT',
       'TAX CLASS AT TIME OF SALE', 'BUILDING CLASS AT TIME OF SALE',
       'SALE PRICE', 'SALE DATE'],
      dtype='object')

In [128]:
brooklyn_16.columns

Index(['BOROUGH\n', 'NEIGHBORHOOD\n', 'BUILDING CLASS CATEGORY\n',
       'TAX CLASS AT PRESENT\n', 'BLOCK\n', 'LOT\n', 'EASE-MENT\n',
       'BUILDING CLASS AT PRESENT\n', 'ADDRESS\n', 'APARTMENT NUMBER\n',
       'ZIP CODE\n', 'RESIDENTIAL UNITS\n', 'COMMERCIAL UNITS\n',
       'TOTAL UNITS\n', 'LAND SQUARE FEET\n', 'GROSS SQUARE FEET\n',
       'YEAR BUILT\n', 'TAX CLASS AT TIME OF SALE\n',
       'BUILDING CLASS AT TIME OF SALE\n', 'SALE PRICE\n', 'SALE DATE\n'],
      dtype='object')

In [129]:
brooklyn_16.columns=brooklyn_16.columns.str.replace('\n', '')

In [130]:
brooklyn_16.columns

Index(['BOROUGH', 'NEIGHBORHOOD', 'BUILDING CLASS CATEGORY',
       'TAX CLASS AT PRESENT', 'BLOCK', 'LOT', 'EASE-MENT',
       'BUILDING CLASS AT PRESENT', 'ADDRESS', 'APARTMENT NUMBER', 'ZIP CODE',
       'RESIDENTIAL UNITS', 'COMMERCIAL UNITS', 'TOTAL UNITS',
       'LAND SQUARE FEET', 'GROSS SQUARE FEET', 'YEAR BUILT',
       'TAX CLASS AT TIME OF SALE', 'BUILDING CLASS AT TIME OF SALE',
       'SALE PRICE', 'SALE DATE'],
      dtype='object')

In [131]:
queens_16.columns=queens_16.columns.str.replace(' ', '_')
queens_03.columns=queens_03.columns.str.replace(' ', '_')
brooklyn_16.columns=brooklyn_16.columns.str.replace(' ', '_')
brooklyn_03.columns=brooklyn_03.columns.str.replace(' ', '_')

In [132]:
queens_03.columns

Index(['BOROUGH', 'NEIGHBORHOOD', 'BUILDING_CLASS_CATEGORY',
       'TAX_CLASS_AT_PRESENT', 'BLOCK', 'LOT', 'EASE-MENT',
       'BUILDING_CLASS_AT_PRESENT', 'ADDRESS', 'APARTMENT_NUMBER', 'ZIP_CODE',
       'RESIDENTIAL_UNITS', 'COMMERCIAL_UNITS', 'TOTAL_UNITS',
       'LAND_SQUARE_FEET', 'GROSS_SQUARE_FEET', 'YEAR_BUILT',
       'TAX_CLASS_AT_TIME_OF_SALE', 'BUILDING_CLASS_AT_TIME_OF_SALE',
       'SALE_PRICE', 'SALE_DATE'],
      dtype='object')

### Datetime
Instead of being uploaded as a date time object, the sale date column in all tables were coded as objects.  These columns must be coded as datetime objects and the index must be reset to follow the new date time object.

In [133]:
queens_03['SALE_DATE']= pd.to_datetime(queens_03['SALE_DATE'])

In [134]:
brooklyn_03['SALE_DATE']= pd.to_datetime(brooklyn_03['SALE_DATE'])

In [135]:
queens_16['SALE_DATE']= pd.to_datetime(queens_16['SALE_DATE'])

In [136]:
brooklyn_16['SALE_DATE']=pd.to_datetime(brooklyn_16['SALE_DATE'])

In [137]:
queens_03.index=pd.to_datetime(queens_03['SALE_DATE'])

In [138]:
queens_16.index=pd.to_datetime(queens_16['SALE_DATE'])

In [139]:
brooklyn_03.index=pd.to_datetime(brooklyn_03['SALE_DATE'])

In [140]:
brooklyn_16.index=pd.to_datetime(brooklyn_16['SALE_DATE'])

In [141]:
queens_03.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 39177 entries, 2003-10-16 to 2003-12-16
Data columns (total 21 columns):
BOROUGH                           39177 non-null int64
NEIGHBORHOOD                      39177 non-null object
BUILDING_CLASS_CATEGORY           39177 non-null object
TAX_CLASS_AT_PRESENT              39177 non-null object
BLOCK                             39177 non-null int64
LOT                               39177 non-null int64
EASE-MENT                         39177 non-null object
BUILDING_CLASS_AT_PRESENT         39177 non-null object
ADDRESS                           39177 non-null object
APARTMENT_NUMBER                  39177 non-null object
ZIP_CODE                          39177 non-null int64
RESIDENTIAL_UNITS                 39177 non-null object
COMMERCIAL_UNITS                  39177 non-null int64
TOTAL_UNITS                       39177 non-null object
LAND_SQUARE_FEET                  39177 non-null object
GROSS_SQUARE_FEET                 39177 non-null object
YEAR_BUILT                        39177 non-null int64
TAX_CLASS_AT_TIME_OF_SALE         39177 non-null int64
BUILDING_CLASS_AT_TIME_OF_SALE    39177 non-null object
SALE_PRICE                        39177 non-null int64
SALE_DATE                         39177 non-null datetime64[ns]
dtypes: datetime64[ns](1), int64(8), object(12)
memory usage: 6.6+ MB

In [151]:
queens_03.to_csv('queens_clean_03.csv')
queens_16.to_csv('queens_clean_16.csv')
brooklyn_03.to_csv('brooklyn_clean_03.csv')
brooklyn_16.to_csv('brooklyn_clean_16.csv')